# RPCNode Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
RPCNode Class
Members See Also
---
This class represents an RPC content in a model-exporting process.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class RPCNode : ContentNode
```

Visual Basic
---
```text
Public Class RPCNode _
	Inherits ContentNode
```

Visual C++
---
```text
public ref class RPCNode : public ContentNode
```

# Remarks
See also: [!:Autodesk::Revit::DB::IExportContext::OnRPC].
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..RenderNode Autodesk.Revit.DB..::..ContentNode Autodesk.Revit.DB..::..RPCNode
# See Also
RPCNode Members
Autodesk.Revit.DB Namespace